a=int(input("Введите ваш год рождения "))
if (a-2000)%12==0:
    print("Дракон")
elif (a-2000)%12==1:
    print("Змея")
elif (a-2000)%12==2:
    print("Лошадь")
elif (a-2000)%12==3:
    print("Коза")
elif (a-2000)%12==4:
    print("Обезьяна")
elif (a-2000)%12==5:
    print("Петух")
elif (a-2000)%12==6:
    print("Собака")
elif (a-2000)%12==7:
    print("Свинья")
elif (a-2000)%12==8:
    print("Крыса")
elif (a-2000)%12==9:
    print("Бык")
elif (a-2000)%12==10:
    print("Тигр")
elif (a-2000)%12==11:
    print("Кролик")
else:
    print("ошибка")
